from keras.preprocessing.text import Tokenizer
import numpy as np
import pandas as pd

text = '나는 진짜 진짜 매우 매우 맛있는 밥을 엄청 마구 마구 마구 먹었다.'
# 수치화 
token = Tokenizer()
token.fit_on_texts([text])

print(token.word_index)
# {'마구': 1, '진짜': 2, '매우': 3, '나는': 4, '맛있는': 5, '밥을': 6, '엄청': 7, '먹었다': 8}
# 많이 먼저 나온 순서를 수치화

print(token.word_counts)
# OrderedDict([('나는', 1), ('진짜', 2), ('매우', 2), ('맛있는', 1), ('밥을', 1), ('엄청', 1), ('마구', 3), ('먹었다', 1)])

x = token.texts_to_sequences([text]) # 리스트라서 넘파이에 reshape기능으로 해야함
print(x)
# [[4, 2, 2, 3, 3, 5, 6, 7, 1, 1, 1, 8]]
x = np.array(x).reshape(12, 1)
print(x.shape)  # (12, 1)
from keras.utils import to_categorical
x1 = to_categorical(x)
'''
print(x1)
# [[[0. 0. 0. 0. 1. 0. 0. 0. 0.]
#   [0. 0. 1. 0. 0. 0. 0. 0. 0.]
#   [0. 0. 1. 0. 0. 0. 0. 0. 0.]
#   [0. 0. 0. 1. 0. 0. 0. 0. 0.]
#   [0. 0. 0. 1. 0. 0. 0. 0. 0.]
#   [0. 0. 0. 0. 0. 1. 0. 0. 0.]
#   [0. 0. 0. 0. 0. 0. 1. 0. 0.]
#   [0. 0. 0. 0. 0. 0. 0. 1. 0.]
#   [0. 1. 0. 0. 0. 0. 0. 0. 0.]
#   [0. 1. 0. 0. 0. 0. 0. 0. 0.]
#   [0. 1. 0. 0. 0. 0. 0. 0. 0.]
#   [0. 0. 0. 0. 0. 0. 0. 0. 1.]]]
print(x1.shape) # (12, 9)) ->  (12, 8)
'''

# #1. to_categorical에서 첫번째 0빼
x1 = x1[:,1:]
print(x1)
# [[0. 0. 0. 1. 0. 0. 0. 0.]
#  [0. 1. 0. 0. 0. 0. 0. 0.]
#  [0. 1. 0. 0. 0. 0. 0. 0.]
#  [0. 0. 1. 0. 0. 0. 0. 0.]
#  [0. 0. 1. 0. 0. 0. 0. 0.]
#  [0. 0. 0. 0. 1. 0. 0. 0.]
#  [0. 0. 0. 0. 0. 1. 0. 0.]
#  [0. 0. 0. 0. 0. 0. 1. 0.]
#  [1. 0. 0. 0. 0. 0. 0. 0.]
#  [1. 0. 0. 0. 0. 0. 0. 0.]
#  [1. 0. 0. 0. 0. 0. 0. 0.]
#  [0. 0. 0. 0. 0. 0. 0. 1.]]
print(x1.shape) # (12, 8)

'''
#2. 사이킷런 원핫인코더
from sklearn.preprocessing import OneHotEncoder
ohe = OneHotEncoder(sparse=False)
x2_ohe = ohe.fit_transform(x)  # toarray() 배열로 바꿔준다.
print(x2_ohe)
# [[0. 0. 0. 1. 0. 0. 0. 0.]
#  [0. 1. 0. 0. 0. 0. 0. 0.]
#  [0. 1. 0. 0. 0. 0. 0. 0.]
#  [0. 0. 1. 0. 0. 0. 0. 0.]
#  [0. 0. 1. 0. 0. 0. 0. 0.]
#  [0. 0. 0. 0. 1. 0. 0. 0.]
#  [0. 0. 0. 0. 0. 1. 0. 0.]
#  [0. 0. 0. 0. 0. 0. 1. 0.]
#  [1. 0. 0. 0. 0. 0. 0. 0.]
#  [1. 0. 0. 0. 0. 0. 0. 0.]
#  [1. 0. 0. 0. 0. 0. 0. 0.]
#  [0. 0. 0. 0. 0. 0. 0. 1.]]
print(x2_ohe.shape) # (12, 8)


#3. 판다스 겟더미
x = np.array(x).reshape(12, )
x3 = pd.get_dummies(x, dtype='int') # 백터만 받는다.
print(x3)
#     1  2  3  4  5  6  7  8
# 0   0  0  0  1  0  0  0  0
# 1   0  1  0  0  0  0  0  0
# 2   0  1  0  0  0  0  0  0
# 3   0  0  1  0  0  0  0  0
# 4   0  0  1  0  0  0  0  0
# 5   0  0  0  0  1  0  0  0
# 6   0  0  0  0  0  1  0  0
# 7   0  0  0  0  0  0  1  0
# 8   1  0  0  0  0  0  0  0
# 9   1  0  0  0  0  0  0  0
# 10  1  0  0  0  0  0  0  0
# 11  0  0  0  0  0  0  0  1
'''